20220621/InformationRegisters/тм_ПраваДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>тм_ПраваДоступа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Чтение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Запись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SA</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

20220621/CommonModules/тм_КЭШ/Ext/Module.bsl
#Если Сервер Тогда
Функция ПолучитьМакет(ПолноеИмя, ИмяМакета) Экспорт

	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
	Возврат МенеджерОбъекта.ПолучитьМакет(ИмяМакета);

КонецФункции // 
#КонецЕсли

Функция ПолучитьПрефиксРасширения() Экспорт

	Возврат "тм_";

КонецФункции // ПрефиксРасширения()
 
Функция ПолучитьПраваОбъекта(Объект, Пользователь) Экспорт
	
	Права = Новый Структура("Чтение, Запись, SA", Ложь, Ложь, Ложь);
	
	#Если Сервер Тогда

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тм_ПраваДоступа.Чтение КАК Чтение,
		|	тм_ПраваДоступа.Запись КАК Запись,
		|	тм_ПраваДоступа.SA КАК SA
		|ИЗ
		|	РегистрСведений.тм_ПраваДоступа КАК тм_ПраваДоступа
		|ГДЕ
		|	тм_ПраваДоступа.Пользователь = &Пользователь
		|	И тм_ПраваДоступа.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Права, Выборка);
	КонецЕсли; 	
	
	#КонецЕсли
	
	Возврат Права;
	
КонецФункции // ПолучитьПраваОбъекта()

Функция СотрудникПользователя(Пользователь) Экспорт
	
	#Если Сервер Тогда
		Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СотрудникиПользователя.Сотрудник КАК Сотрудник
			|ИЗ
			|	РегистрСведений.СотрудникиПользователя КАК СотрудникиПользователя
			|ГДЕ
			|	СотрудникиПользователя.Пользователь = &Пользователь";
		
		Запрос.УстановитьПараметр("Пользователь", Пользователь);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			Сотрудник = Выборка.Сотрудник;	
		КонецЕсли; 
		
		Возврат Сотрудник;
	#Иначе
		Возврат ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
	#КонецЕсли

КонецФункции // СотрудникПользователя()
